Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.wk_config will be created
+ resource "proxmox_virtual_environment_file" "wk_config" {
      + content_type           = "snippets"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                #cloud-config
                write_files:
                  - path: /etc/systemd/system/k3s-agent.service
                    content: |
                      [Unit]
                      Description=Lightweight Kubernetes
                      Documentation=https://k3s.io
                
                      [Service]
                      ExecStartPre=-/sbin/modprobe br_netfilter
                      ExecStartPre=-/sbin/modprobe overlay
                      ExecStartPre=/sbin/sysctl -w net.ipv4.conf.all.rp_filter=1
                      ExecStartPre=/sbin/sysctl -w net.ipv4.conf.default.rp_filter=1
                      ExecStartPre=/sbin/sysctl -w net.bridge.bridge-nf-call-iptables=1
                      ExecStartPre=/sbin/sysctl -w net.bridge.bridge-nf-call-ip6tables=1
                      ExecStart=/usr/local/bin/k3s agent
                
                      [Install]
                      WantedBy=multi-user.target
                
                runcmd:
                  - curl -sfL https://get.k3s.io | INSTALL_K3S_EXEC="--node-taint CriticalAddonsOnly=true:NoExecute" sh -
            EOT
          + file_name = "example.cloud-config.yaml"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-0"
      + network_interface_names = (known after apply)
      + node_name               = "promox"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 550

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.120/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 512
          + floating  = 0
          + shared    = 5125
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-1"
      + network_interface_names = (known after apply)
      + node_name               = "prox2"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 551

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.121/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 512
          + floating  = 0
          + shared    = 5125
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-2"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 552

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.122/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 512
          + floating  = 0
          + shared    = 5125
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b498d417ac9c:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`